fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачислениеПриИзменении(Элемент)
	
	ИзменитьПериодДействия();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИзменитьПериодДействия();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьПериодДействия()

	Если Объект.Начисление = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
		Элементы.ДатаНачалаПериодаДействия.Доступность = Истина;
		Элементы.ДатаОкончанияПериодаДействия.Доступность = Истина;
	Иначе
		Объект.ДатаНачалаПериодаДействия = НачалоМесяца(Объект.Дата);
		Объект.ДатаОкончанияПериодаДействия = КонецМесяца(Объект.Дата);
		Элементы.ДатаНачалаПериодаДействия.Доступность = Ложь;
		Элементы.ДатаОкончанияПериодаДействия.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
